Revit 2024 API
AnalysisDisplayColoredSurfaceSettings.ShowGridLines Property
 If true, show grid lines in the analysis display.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public bool ShowGridLines { get; set; }
Visual Basic
Public Property ShowGridLines As Boolean
	Get
	Set
Visual C++
public:
property bool ShowGridLines {
	bool get ();
	void set (bool value);
}
See Also
AnalysisDisplayColoredSurfaceSettings Class
Autodesk.Revit.DB.Analysis Namespace